#include<iostream>

using namespace std;

void main()
{
	//오늘 숙제
	//숫자 야수 만들기

	// (3자리 수월하면 4자리 숫자로 진행)
	// 컴퓨터가 랜덤으로 겹치지 않는 3자리 숫자를 고른다.
	// 이때 첫번째 자리는 무조건 1이상이어야 함
	// ex. 777(x) 789(o) 154(o) 155(x)

	// 플레이어는 1회, 2회, 3회, ... 9회까지 게임을 플레이한다.
	// 플레이어는 회마다 겹치지 않는 숫자를 부른다.
	// // 이때 첫번째 자리는 무조건 1이상이어야 함
	// ex. 777(x) 789(o) 154(o) 155(x)

	// 자릿수와 숫자가 모두 일치하면 strike 
	// 숫자는 일치하지만 자릿수가 일치하지 않으면 ball
	// 을 카운트하여 현황판을 출력한다

	// ex. 컴퓨터가 고른 숫자: 154
	// ex. 플레이어가 고른 숫자 : 149
	// ==> 1s 1b

	//


	// 별찍기 만들기

	// 2중포문을 활용하여 아래 별을 찍어보세요.
	//
	// 1번
	// *
	// **
	// ***
	// ****
	// *****

	// 2번
	// *****
	// ****
	// ***
	// **
	// *

	// 3번
	//       *
	//     **
	//   ***
	//  ****
	//*****

	// 4번
	//*****
	//  ****
	//    ***
	//      **
	//        *


	// 5번
	//*     *****
	//**    ****
	//***  ***
	//**** **
	//******
	//      *****
	//    ** ****
	//   ***  ***
	//  ****   **
	//*****     *
}