#include<iostream>
using namespace std;
void main()
{

	// 별찍기 만들기

		// 2중포문을 활용하여 아래 별을 찍어보세요.
		//
		// 1번
		// *
		// **
		// ***
		// ****
		// *****

	for (int i = 0; i < 6;i++)
	{
		for (int j = 0; j < 6; j++)
		{
			if (i > j)
			{
				cout << "*";
			}
		}
		cout << endl;
	}
	
	// 2번
	// *****
	// ****
	// ***
	// **
	// *
	cout << "==================" << endl;
	for (int i = 0; i < 6;i++)
	{
		for (int j = 0; j < 6; j++)
		{
			if (i < j)
			{
				cout << "*";
			}
		}
		cout << endl;
	}

	// 3번
	//       *
	//     **
	//   ***
	//  ****
	//*****
	cout << "==================" << endl;
	for (int i = 0; i < 6;i++)
	{
		for (int j = 0; j < 6; j++)
		{
			if (i <= j)
			{
				cout << "*";
			}
			else
			{
				cout << " ";
			}
			cout << endl;
		}

		// 4번
		//*****
		//  ****
		//    ***
		//      **
		//        *


		// 5번
		//*     *****
		//**    ****
		//***  ***
		//**** **
		//******
		//      *****
		//    ** ****
		//   ***  ***
		//  ****   **
		//*****     *

	}


